InformationRegisters/ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменяемыйПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказИндивидуальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиапазонСуммЗайма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменяемыйПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказИндивидуальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Металл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеМеталлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проба</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтклонениеОтБазовойЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменяемыйПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказИндивидуальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтклонениеОтБазовойЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КачествоОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КачествоОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийПриказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийПриказы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьВИП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ФормаНастроекОтеныИндивидуальногоПриказа/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТекущийПриказ") Тогда
		ТекущийПриказ = Параметры.ТекущийПриказ.Ссылка;
		ОтменаСтавок = ТекущийПриказ.ОтменаСтавок;
		ОтменаМеталлов = ТекущийПриказ.ОтменаМеталлов;
		ОтменаВставкок = ТекущийПриказ.ОтменаВставкок;
		
		
	КонецЕсли;

	Если Параметры.Свойство("Залогодатели") Тогда
		Залогодатели.Очистить();
		ЗалогодателиВыбранные.Очистить();
		ЗалогодателиВыбранные.Загрузить(Параметры.Залогодатели.Выгрузить());
		Элементы.ЗалогодателиВыбранныеЗалогодатель.ТекстПодвала = ЗалогодателиВыбранные.Количество();
	КонецЕсли;

	Если Параметры.Свойство("ТолькоПросмотр") Тогда
		ТолькоПросмотр = Параметры.ТолькоПросмотр;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтменяемыеПриказы") Тогда
		ПриказыДляОтмены.Очистить();
		ПриказыДляОтмены.Загрузить(Параметры.ОтменяемыеПриказы.Выгрузить());
	КонецЕсли;
	
	Если НЕ ТолькоПросмотр Тогда
		ЗаполнитьСписокЗалогодателейДляВыбора();
		УдалитьЗалогодателейПриоткрытии();
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗалогодателейПриоткрытии()
	МассивУдаления = Новый Массив;
	
	Для каждого Стр Из ЗалогодателиВыбранные Цикл
		//СтрЗ = Залогодатели.НайтиПоИдентификатору(Стр); // Получить(СтрМ);
		
		Отбор = Новый Структура;
		Отбор.Вставить("Залогодатель", Стр.Залогодатель);
		
		МассивЗ = Залогодатели.НайтиСтроки(Отбор);
		
		Если МассивЗ.Количество() > 0 Тогда
			МассивУдаления.Добавить(МассивЗ[0]);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрМ Из МассивУдаления Цикл
		Залогодатели.Удалить(СтрМ);
	КонецЦикла;

	Элементы.ЗалогодателиЗалогодатель.ТекстПодвала = Залогодатели.Количество();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Если ТолькоПросмотр Тогда
		ЭтаФорма.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьИЗакрытьНаСервере()
	
	ДокОбъектОтмены	= ТекущийПриказ.ПолучитьОбъект();

	ДокОбъектОтмены.СтавкиПроцентов.Очистить();
	ДокОбъектОтмены.НастройкаОтклоненийОтБазовыхЦенМеталлы.Очистить();
	ДокОбъектОтмены.НастройкаОтклоненийОтБазовыхЦенВставки.Очистить();
	
	ЗагрузитьСтавки = Истина;
	ЗагрузитьМеталлы = Истина;
	ЗагрузитьВставки = Истина;
	
	Для каждого Стр Из ПриказыДляОтмены Цикл
		Если ЗагрузитьСтавки И ОтменаСтавок И Стр.Ставки Тогда
			ДокОбъектОтмены.СтавкиПроцентов.Загрузить(Стр.Приказ.СтавкиПроцентов.Выгрузить());
			ЗагрузитьСтавки = Ложь;
		КонецЕсли;
		
		Если ЗагрузитьМеталлы И ОтменаМеталлов И Стр.Металлы Тогда
			ДокОбъектОтмены.НастройкаОтклоненийОтБазовыхЦенМеталлы.Загрузить(Стр.Приказ.НастройкаОтклоненийОтБазовыхЦенМеталлы.Выгрузить());
			ЗагрузитьМеталлы = Ложь;
		КонецЕсли;
		
		Если ЗагрузитьВставки И ОтменаВставкок И Стр.Вставки Тогда
			ДокОбъектОтмены.НастройкаОтклоненийОтБазовыхЦенВставки.Загрузить(Стр.Приказ.НастройкаОтклоненийОтБазовыхЦенВставки.Выгрузить());
			ЗагрузитьВставки = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ДокОбъектОтмены.Залогодатели.Очистить();
	ДокОбъектОтмены.Залогодатели.Загрузить(ЗалогодателиВыбранные.Выгрузить());
	ДокОбъектОтмены.ОтменяемыеПриказы.Очистить();
	ДокОбъектОтмены.ОтменяемыеПриказы.Загрузить(ПриказыДляОтмены.Выгрузить());
	
	//+МАН 13.11.24 Заполнение строки залогодателей в документе. Заявка 2792
	СтрЗалогодателей = "";
	Для каждого Стр Из ДокОбъектОтмены.Залогодатели Цикл
		СтрЗалогодателей = СтрЗалогодателей + ?(ПустаяСтрока(СтрЗалогодателей), "", "; ") + СокрЛП(Стр.Залогодатель.Наименование);
	КонецЦикла;	
	ДокОбъектОтмены.СтрокаЗалогодатели = СтрЗалогодателей; 
	//-МАН
	
	ТекстНомераПриказов = "";
	Для каждого Стр Из ПриказыДляОтмены Цикл
		ТекстНомераПриказов = ?(ТекстНомераПриказов = "", "" + Стр.НомерПриказа, ТекстНомераПриказов + "; " + Стр.НомерПриказа)
	КонецЦикла;
	
	ДокОбъектОтмены.ОтменяемыеПриказыСтрока = ТекстНомераПриказов;
	ДокОбъектОтмены.ОтменаСтавок = ОтменаСтавок;
	ДокОбъектОтмены.ОтменаМеталлов = ОтменаМеталлов;
	ДокОбъектОтмены.ОтменаВставкок = ОтменаВставкок;
	
	ДокОбъектОтмены.Записать(РежимЗаписиДокумента.Запись);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	Если ЗалогодателиВыбранные.Количество() = 0 Тогда
		Предупреждение("Не выбраны залогодатели!");
		Возврат;
	КонецЕсли;
	
	Если НЕ ОтменаСтавок И НЕ ОтменаМеталлов И НЕ ОтменаВставкок Тогда
		Предупреждение("Не выбраны отменяемые условия!");
		Возврат;
	КонецЕсли;
	
	Если ПриказыДляОтмены.Количество() = 0 Тогда
		Если ЗалогодателиВыбранные.Количество() = 1 Тогда
			Предупреждение("По данному клиенту нет условий которые можно отменить");
		ИначеЕсли ЗалогодателиВыбранные.Количество() > 1 Тогда
			Предупреждение("По данным клиентам нет условий которые можно отменить");
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	СохранитьИЗакрытьНаСервере();
	ЭтаФорма.Закрыть(Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораПриказа(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗалогодателиВыбранные.Очистить();
	
	ТЗЗалогодатели = Результат.Залогодатели.Выгрузить();
	
	ЗалогодателиВыбранные.Загрузить(ТЗЗалогодатели);
	
	МассивУдаления = Новый Массив;
	
	Для каждого Стр Из ТЗЗалогодатели Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Залогодатель", Стр.Залогодатель);
		
		МНайденных = Залогодатели.НайтиСтроки(Отбор);
		
		Для каждого СтрНайденных Из МНайденных Цикл
			МассивУдаления.Добавить(СтрНайденных);
		КонецЦикла;
		
	КонецЦикла;

	Для каждого СтрМ Из МассивУдаления Цикл
		Залогодатели.Удалить(СтрМ);
	КонецЦикла;
	
	ЗалогодателиВыбранные.Сортировать("Залогодатель Возр");
	Залогодатели.Сортировать("Залогодатель Возр");
	Элементы.ЗалогодателиВыбранныеЗалогодатель.ТекстПодвала = ЗалогодателиВыбранные.Количество();
	Элементы.ЗалогодателиЗалогодатель.ТекстПодвала = Залогодатели.Количество();
	ПолучитьПриказыДляОтменыПоЗалогодателям(ОтменаСтавок, ОтменаМеталлов, ОтменаВставкок);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПриказ(Команда)

	Если ЗалогодателиВыбранные.Количество() > 0 Тогда
		Ответ = Вопрос("При загрузке залогодателей из приказа очистится список выбранных залогодателей."
		+ Символы.ПС + "Продолжить?", РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПриказа", ЭтаФорма);

			ПараметрыФормы = Новый Структура("ТекущаяДата", ТекущаяДата());

			ОткрытьФорму("Документ.ЛБ_ПриказИндивидуальныеУсловия.Форма.ФормаВыбораДокументаОтмены",ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПриказа", ЭтаФорма);
		
		ПараметрыФормы = Новый Структура("ТекущаяДата", ТекущаяДата());
			
		ОткрытьФорму("Документ.ЛБ_ПриказИндивидуальныеУсловия.Форма.ФормаВыбораДокументаОтмены",ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗалогодателиВыбранныеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	ДобавитьЗалогодателя(Элементы.Залогодатели.ВыделенныеСтроки, Неопределено); //.ТекущиеДанные); //.Залогодатель);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗалогодателя(Массив, ДанныеЗалогодателя) //Залогодатель)

	Если Массив <> Неопределено И ДанныеЗалогодателя = Неопределено Тогда
		
		МассивУдаления = Новый Массив;
		
		Для каждого СтрМ Из Массив Цикл
			СтрЗ = Залогодатели.НайтиПоИдентификатору(СтрМ); // Получить(СтрМ);
			
			Отбор = Новый Структура;
			Отбор.Вставить("Залогодатель", СтрЗ.Залогодатель);
			
			НайденныйЗалогодатель = ЗалогодателиВыбранные.НайтиСтроки(Отбор);
			
			Если НайденныйЗалогодатель.Количество() > 0 Тогда
				Сообщить("" + Строка(СтрЗ.Залогодатель) + " уже выбран.");
				//Возврат;
			Иначе
				НоваяСтр = ЗалогодателиВыбранные.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр, СтрЗ);
				
				МассивУдаления.Добавить(СтрЗ);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого СтрМ Из МассивУдаления Цикл
			Залогодатели.Удалить(СтрМ);
		КонецЦикла;
		
	ИначеЕсли Массив = Неопределено И ДанныеЗалогодателя <> Неопределено Тогда
		
			Отбор = Новый Структура;
			Отбор.Вставить("Залогодатель", ДанныеЗалогодателя.Залогодатель);
			
			НайденныйЗалогодатель = ЗалогодателиВыбранные.НайтиСтроки(Отбор);
			
			Если НайденныйЗалогодатель.Количество() > 0 Тогда
				Сообщить("Данный залогодатель уже выбран.");
				Возврат;
			Иначе
				НоваяСтр = ЗалогодателиВыбранные.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр, ДанныеЗалогодателя);
				
				МЗалогодатели = Залогодатели.НайтиСтроки(Отбор);
				
				Если МЗалогодатели.Количество() > 0 Тогда
					Для каждого СтрЗ Из МЗалогодатели Цикл
						Залогодатели.Удалить(СтрЗ);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
	КонецЕсли;
	
	ЗалогодателиВыбранные.Сортировать("Залогодатель Возр");
	Залогодатели.Сортировать("Залогодатель Возр");
	Элементы.ЗалогодателиВыбранныеЗалогодатель.ТекстПодвала = ЗалогодателиВыбранные.Количество();
	Элементы.ЗалогодателиЗалогодатель.ТекстПодвала = Залогодатели.Количество();
	//УстановитьВидимость();
	ПолучитьПриказыДляОтменыПоЗалогодателям(ОтменаСтавок, ОтменаМеталлов, ОтменаВставкок)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗалогодателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДобавитьЗалогодателя(Неопределено, Элемент.ТекущиеДанные); //.Залогодатель);
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	УдалитьЗалогодателя(Элементы.ЗалогодателиВыбранные.ВыделенныеСтроки, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЗалогодателиВыбранныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	УдалитьЗалогодателя(Неопределено, Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗалогодателя(Массив, ДанныеЗалогодателя)
	
	Если Массив <> Неопределено И ДанныеЗалогодателя = Неопределено Тогда

		МассивУдаления = Новый Массив;
		
		Для каждого СтрМ Из Массив Цикл
			СтрЗ = ЗалогодателиВыбранные.НайтиПоИдентификатору(СтрМ); // Получить(СтрМ);
			
			Отбор = Новый Структура;
			Отбор.Вставить("Залогодатель", СтрЗ.Залогодатель);
			
			НоваяСтр = Залогодатели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтр, СтрЗ);
				
			МассивУдаления.Добавить(СтрЗ);
		КонецЦикла;
		
		Для каждого СтрМ Из МассивУдаления Цикл
			ЗалогодателиВыбранные.Удалить(СтрМ);
		КонецЦикла;
		
	ИначеЕсли Массив = Неопределено И ДанныеЗалогодателя <> Неопределено Тогда
		
			Отбор = Новый Структура;
			Отбор.Вставить("Залогодатель", ДанныеЗалогодателя.Залогодатель);
			
			НоваяСтр = Залогодатели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтр, ДанныеЗалогодателя);
			
			МЗалогодатели = ЗалогодателиВыбранные.НайтиСтроки(Отбор);
			
			Если МЗалогодатели.Количество() > 0 Тогда
				Для каждого СтрЗ Из МЗалогодатели Цикл
					ЗалогодателиВыбранные.Удалить(СтрЗ);
				КонецЦикла;
			КонецЕсли;
	КонецЕсли;
	
	ЗалогодателиВыбранные.Сортировать("Залогодатель Возр");
	Залогодатели.Сортировать("Залогодатель Возр");
	Элементы.ЗалогодателиВыбранныеЗалогодатель.ТекстПодвала = ЗалогодателиВыбранные.Количество();
	Элементы.ЗалогодателиЗалогодатель.ТекстПодвала = Залогодатели.Количество();
	//УстановитьВидимость();
	ПолучитьПриказыДляОтменыПоЗалогодателям(ОтменаСтавок, ОтменаМеталлов, ОтменаВставкок)
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЗалогодателейДляВыбора()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель КАК Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель.Наименование КАК ЗалогодательНаименование
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		|			ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
		|		ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель.Наименование
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|ГДЕ
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
		|			ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
		|		ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель.Наименование
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|ГДЕ
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
		|			ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
		|		ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗалогодательНаименование";
	
	//Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(ТекущийПриказ),ТекущийПриказ.Дата, ТекущаяДата()));
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Залогодатели.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Элементы.ЗалогодателиЗалогодатель.ТекстПодвала = Залогодатели.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗалогодателиВыбранныеПередУдалением(Элемент, Отказ)
	УдалитьЗалогодателя(Элемент.ВыделенныеСтроки, Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПолучитьПриказыДляОтменыПоЗалогодателям(Ставки, Металлы, Вставки)

	ТЗПриказы = ПриказыДляОтмены.Выгрузить();
	ТЗПриказы.Очистить();
	
	ПриказыДляОтмены.Очистить();
	
	Если Ставки ИЛИ Металлы ИЛИ Вставки Тогда
		Для каждого Стр Из ЗалогодателиВыбранные Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ Ставки
			|ИЗ
			|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
			|ГДЕ
			|	ВЫБОР
			|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
			|				ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
			|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ Металлы
			|ИЗ
			|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
			|ГДЕ
			|	ВЫБОР
			|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
			|				ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
			|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ Вставки
			|ИЗ
			|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
			|ГДЕ
			|	ВЫБОР
			|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
			|				ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
			|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	Ставки.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ СтавкиСорт
			|ИЗ
			|	Ставки КАК Ставки
			|
			|УПОРЯДОЧИТЬ ПО
			|	Ставки.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
			|	Ставки.Регистратор.Дата УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	Металлы.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ МеталыСорт
			|ИЗ
			|	Металлы КАК Металлы
			|
			|УПОРЯДОЧИТЬ ПО
			|	Металлы.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
			|	Металлы.Регистратор.Дата УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	Вставки.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ ВставкиСорт
			|ИЗ
			|	Вставки КАК Вставки
			|
			|УПОРЯДОЧИТЬ ПО
			|	Вставки.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
			|	Вставки.Регистратор.Дата УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СтавкиСорт.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ СтавкиПерв
			|ИЗ
			|	СтавкиСорт КАК СтавкиСорт
			|ГДЕ
			|	НЕ СтавкиСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
			|	И НЕ СтавкиСорт.Регистратор В
			|				(ВЫБРАТЬ
			|					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
			|				ИЗ
			|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
			|				ГДЕ
			|					ВЫБОР
			|						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
			|							ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
			|						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
			|					КОНЕЦ
			|					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
			|					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
			|				СГРУППИРОВАТЬ ПО
			|					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ)
			|	И ВЫБОР
			|			КОГДА СтавкиСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА ИСТИНА
			|			КОГДА СтавкиСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МеталыСорт.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ МеталыПерв
			|ИЗ
			|	МеталыСорт КАК МеталыСорт
			|ГДЕ
			|	НЕ МеталыСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
			|	И НЕ МеталыСорт.Регистратор В
			|				(ВЫБРАТЬ
			|					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ КАК ОтменяемыйПриказ
			|				ИЗ
			|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
			|				ГДЕ
			|					ВЫБОР
			|						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
			|							ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
			|						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
			|					КОНЕЦ
			|					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
			|					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
			|				СГРУППИРОВАТЬ ПО
			|					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ)
			|	И ВЫБОР
			|			КОГДА МеталыСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА ИСТИНА
			|			КОГДА МеталыСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВставкиСорт.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ ВставкиПерв
			|ИЗ
			|	ВставкиСорт КАК ВставкиСорт
			|ГДЕ
			|	НЕ ВставкиСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
			|	И НЕ ВставкиСорт.Регистратор В
			|				(ВЫБРАТЬ
			|					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
			|				ИЗ
			|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
			|				ГДЕ
			|					ВЫБОР
			|						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
			|							ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
			|						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
			|					КОНЕЦ
			|					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
			|					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
			|				СГРУППИРОВАТЬ ПО
			|					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ)
			|	И ВЫБОР
			|			КОГДА ВставкиСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА ИСТИНА
			|			КОГДА ВставкиСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СтавкиПерв.Регистратор КАК Приказ,
			|	СтавкиПерв.Регистратор.НомерПриказа КАК НомерПриказа,
			|	СтавкиПерв.Регистратор.НомерСистемныйЧисло КАК СистемныйНомер,
			|	СтавкиПерв.Регистратор.Дата КАК ДатаДокумента,
			|	СтавкиПерв.Регистратор.ДатаНачалаДействияПриказа КАК ДатаНачалаДействия,
			|	СтавкиПерв.Регистратор.ДатаОкончанияДействияПриказа КАК ДатаОкончанияДействия,
			|	ИСТИНА КАК Ставки,
			|	ЛОЖЬ КАК Металлы,
			|	ЛОЖЬ КАК Вставки
			|ПОМЕСТИТЬ Общая
			|ИЗ
			|	СтавкиПерв КАК СтавкиПерв
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	МеталыПерв.Регистратор,
			|	МеталыПерв.Регистратор.НомерПриказа,
			|	МеталыПерв.Регистратор.НомерСистемныйЧисло,
			|	МеталыПерв.Регистратор.Дата,
			|	МеталыПерв.Регистратор.ДатаНачалаДействияПриказа,
			|	МеталыПерв.Регистратор.ДатаОкончанияДействияПриказа,
			|	ЛОЖЬ,
			|	ИСТИНА,
			|	ЛОЖЬ
			|ИЗ
			|	МеталыПерв КАК МеталыПерв
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ВставкиПерв.Регистратор,
			|	ВставкиПерв.Регистратор.НомерПриказа,
			|	ВставкиПерв.Регистратор.НомерСистемныйЧисло,
			|	ВставкиПерв.Регистратор.Дата,
			|	ВставкиПерв.Регистратор.ДатаНачалаДействияПриказа,
			|	ВставкиПерв.Регистратор.ДатаОкончанияДействияПриказа,
			|	ЛОЖЬ,
			|	ЛОЖЬ,
			|	ИСТИНА
			|ИЗ
			|	ВставкиПерв КАК ВставкиПерв
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Общая.Приказ КАК Приказ,
			|	Общая.НомерПриказа КАК НомерПриказа,
			|	Общая.СистемныйНомер КАК СистемныйНомер,
			|	Общая.ДатаДокумента КАК ДатаДокумента,
			|	Общая.ДатаНачалаДействия КАК ДатаНачалаДействия,
			|	Общая.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
			|	МАКСИМУМ(Общая.Ставки) КАК Ставки,
			|	МАКСИМУМ(Общая.Металлы) КАК Металлы,
			|	МАКСИМУМ(Общая.Вставки) КАК Вставки
			|ИЗ
			|	Общая КАК Общая
			|
			|СГРУППИРОВАТЬ ПО
			|	Общая.Приказ,
			|	Общая.НомерПриказа,
			|	Общая.ДатаДокумента,
			|	Общая.ДатаНачалаДействия,
			|	Общая.ДатаОкончанияДействия,
			|	Общая.СистемныйНомер";
			
			Запрос.УстановитьПараметр("Дата", ТекущаяДата());
			Запрос.УстановитьПараметр("Залогодатель", Стр.Залогодатель);

			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			
			Пока РезультатЗапроса.Следующий() Цикл
				Если Ставки И РезультатЗапроса.Ставки Тогда
					НоваяСтр = ТЗПриказы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтр, РезультатЗапроса);
					НоваяСтр.Залогодатель = Стр.Залогодатель;
				ИначеЕсли Металлы И РезультатЗапроса.Металлы Тогда
					НоваяСтр = ТЗПриказы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтр, РезультатЗапроса);
					НоваяСтр.Залогодатель = Стр.Залогодатель;
				ИначеЕсли Вставки И РезультатЗапроса.Вставки Тогда
					НоваяСтр = ТЗПриказы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтр, РезультатЗапроса);
					НоваяСтр.Залогодатель = Стр.Залогодатель;
				КонецЕсли;
				
				Если (Ставки И РезультатЗапроса.Ставки) ИЛИ (Металлы И РезультатЗапроса.Металлы) ИЛИ (Вставки И РезультатЗапроса.Вставки) Тогда
					Если Ставки И НЕ Металлы И НЕ Вставки Тогда
						НоваяСтр.Ставки = РезультатЗапроса.Ставки;
						НоваяСтр.Металлы = Ложь;
						НоваяСтр.Вставки = Ложь;
					ИначеЕсли Ставки И Металлы И НЕ Вставки Тогда
						НоваяСтр.Ставки = РезультатЗапроса.Ставки;
						НоваяСтр.Металлы = РезультатЗапроса.Металлы;
						НоваяСтр.Вставки = Ложь;
					ИначеЕсли Ставки И Металлы И Вставки Тогда
						НоваяСтр.Ставки = РезультатЗапроса.Ставки;
						НоваяСтр.Металлы = РезультатЗапроса.Металлы;
						НоваяСтр.Вставки = РезультатЗапроса.Вставки;
					ИначеЕсли НЕ Ставки И Металлы И НЕ Вставки Тогда
						НоваяСтр.Ставки = Ложь;
						НоваяСтр.Металлы = РезультатЗапроса.Металлы;
						НоваяСтр.Вставки = Ложь;
					ИначеЕсли НЕ Ставки И Металлы И Вставки Тогда
						НоваяСтр.Ставки = Ложь;
						НоваяСтр.Металлы = РезультатЗапроса.Металлы;
						НоваяСтр.Вставки = РезультатЗапроса.Вставки;
					ИначеЕсли НЕ Ставки И НЕ Металлы И Вставки Тогда
						НоваяСтр.Ставки = Ложь;
						НоваяСтр.Металлы = Ложь;
						НоваяСтр.Вставки = РезультатЗапроса.Вставки;
					ИначеЕсли Ставки И НЕ Металлы И Вставки Тогда
						НоваяСтр.Ставки = РезультатЗапроса.Ставки;
						НоваяСтр.Металлы = Ложь;
						НоваяСтр.Вставки = РезультатЗапроса.Вставки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ТЗПриказы.Свернуть("Залогодатель, Приказ, НомерПриказа, СистемныйНомер, ДатаДокумента, ДатаНачалаДействия, ДатаОкончанияДействия, Ставки, Металлы, Вставки");
		ПриказыДляОтмены.Загрузить(ТЗПриказы);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменаСтавокПриИзменении(Элемент)
	ПолучитьПриказыДляОтменыПоЗалогодателям(ОтменаСтавок, ОтменаМеталлов, ОтменаВставкок);
КонецПроцедуры

&НаКлиенте
Процедура ОтменаМеталловПриИзменении(Элемент)
	ПолучитьПриказыДляОтменыПоЗалогодателям(ОтменаСтавок, ОтменаМеталлов, ОтменаВставкок);
КонецПроцедуры

&НаКлиенте
Процедура ОтменаВставкокПриИзменении(Элемент)
	ПолучитьПриказыДляОтменыПоЗалогодателям(ОтменаСтавок, ОтменаМеталлов, ОтменаВставкок);
КонецПроцедуры
